---
kind: type
id: T:Autodesk.Revit.DB.DisciplineTypeId
source: html/1f44ffd1-9851-60b4-2754-e82d785bad40.htm
---
# Autodesk.Revit.DB.DisciplineTypeId

This class contains constants identifying disciplines.

## Syntax (C#)
```csharp
public static class DisciplineTypeId
```